In [9]:
import pandas as pd
frame = pd.DataFrame({'numbers':range(10),'chars':['a']*10})

In [10]:
frame

  chars  numbers
0     a        0
1     a        1
2     a        2
3     a        3
4     a        4
5     a        5
6     a        6
7     a        7
8     a        8
9     a        9

In [13]:
frame = pd.read_csv('untitled.txt', header = 0, sep ='\t')
frame

      Name       Birth       City  Position
0   Иванов  22.03.1980     Москва  Менеджер
1   Петров  07.08.1965     Казань  Менеджер
2  Сидоров  13.02.1980  Волгоград  Менеджер
3   Иванов  15.04.1985     Москва  Менеджер
4   Петров  19.11.1985      Питер  Менеджер
5  Сидоров  31.05.1985     Москва  Менеджер

In [17]:
frame.columns

Index([u'Name', u'Birth', u'City', u'Position'], dtype='object')

In [18]:
frame.shape

(6, 4)

In [21]:
new_line = {'Name':'Petrov','Birth':'22.03.1990','City':'Penza'}
frame.append(new_line,ignore_index = True)

      Name       Birth       City  Position
0   Иванов  22.03.1980     Москва  Менеджер
1   Петров  07.08.1965     Казань  Менеджер
2  Сидоров  13.02.1980  Волгоград  Менеджер
3   Иванов  15.04.1985     Москва  Менеджер
4   Петров  19.11.1985      Питер  Менеджер
5  Сидоров  31.05.1985     Москва  Менеджер
6   Petrov  22.03.1990      Penza       NaN

In [23]:
frame = frame.append(new_line,ignore_index = True)

In [24]:
frame['isStudent'] = [False]*5+[True]*2
frame

      Name       Birth       City  Position  isStudent
0   Иванов  22.03.1980     Москва  Менеджер      False
1   Петров  07.08.1965     Казань  Менеджер      False
2  Сидоров  13.02.1980  Волгоград  Менеджер      False
3   Иванов  15.04.1985     Москва  Менеджер      False
4   Петров  19.11.1985      Питер  Менеджер      False
5  Сидоров  31.05.1985     Москва  Менеджер       True
6   Petrov  22.03.1990      Penza       NaN       True

In [31]:
frame.drop([5,6],axis = 0,inplace = True)
frame

KeyError: '[5 6] not found in axis'

In [30]:
frame

      Name       Birth       City  Position  isStudent
0   Иванов  22.03.1980     Москва  Менеджер      False
1   Петров  07.08.1965     Казань  Менеджер      False
2  Сидоров  13.02.1980  Волгоград  Менеджер      False
3   Иванов  15.04.1985     Москва  Менеджер      False
4   Петров  19.11.1985      Питер  Менеджер      False

In [32]:
frame.drop('isStudent',axis=1,inplace=True)

In [33]:
frame

      Name       Birth       City  Position
0   Иванов  22.03.1980     Москва  Менеджер
1   Петров  07.08.1965     Казань  Менеджер
2  Сидоров  13.02.1980  Волгоград  Менеджер
3   Иванов  15.04.1985     Москва  Менеджер
4   Петров  19.11.1985      Питер  Менеджер

In [34]:
frame.to_csv('fale_data.csv',sep = ',',header = True, index = None)
!cat fale_data.csv

Name,Birth,City,Position
Иванов,22.03.1980,Москва,Менеджер
Петров,07.08.1965,Казань,Менеджер
Сидоров,13.02.1980,Волгоград,Менеджер
Иванов,15.04.1985,Москва,Менеджер
Петров,19.11.1985,Питер,Менеджер